Repository: joshanashakya/literature_review
Catalog: workspace/opus_corpus/compiled/ted2020v1/en-ne.tmx
Source language: en
Languages: ne

source: To represent girls in their different phases of puberty, we have three characters.
ne: युवतीहरुको यौवनावस्थाका बिभिन्न चरणहरुको प्रतिनिधित्वगर्न हामी संग ३ वटा पात्र छन् -

source: Pinki, who has not gotten her period yet, Jiya who gets her period during the narrative of the book and Mira who has already been getting her period.
ne: पिंकी - जसको अहिले सम्म महिनावारी सुरुभएको छैन । जिया - कमिक पढ्दै जाने क्रममा उसको पहिलो महिनावारी हुन्छ । मीरा - उसको पहिलेनै महिनावारी सुरु भइसकेको छ ।

source: There is a fourth character, Priya Didi.
ne: कथामा चौथो चरित्र पनि छ - प्रिया दिदी

source: Through her, girls come to know about the various aspects of growing up and menstrual hygiene management.
ne: उनकै माध्यमले केटीहरुले बढ्दो उमेर तथा महिनावारीको सरसफाई व्यवस्थापनको बारेमा जानकारी पाउछन् ।

source: While making the book, we took great care that none of the illustrations were objectionable in any way and that it is culturally sensitive.
ne: कमिक बनाउने क्रममा हामीले कुनै पनि चित्रले कतैबाट प्रश्न नउठोस् वा सांस्कृतिक भावनामा चोट नपुगोस् भन्ने कुरामा खूब ध्यान दिएका छौं ।

source: During our prototype testing, we found that the girls loved the book.
ne: किताब छापेर नमुनाको रुपमा पठाउँदा युवतीहरुले किताब खूब मन पराएको पायौँ ।

source: They were keen on reading it and knowing more and more about periods on their own.
ne: उनीहरु त्यो किताब पढ़ेर महिनावारीको बारेमा आफैं थाहा पाउन उत्सुक देखिन्थे ।

source: Parents and teachers were comfortable in talking about periods to young girls using the book, and sometimes even boys were interested in reading it.
ne: अविभावक तथा शिक्षकहरु सोही किताबले महिनावारीको विषयमा छलफल गर्न सहज महसूस गर्दै थिए । कहिले काही केटाहरु समेत सो किताब पढ्न उत्सुक देखिन्थे ।

source: (Laughter) (Applause) The comic book helped in creating an environment where menstruation ceased to be a taboo.
ne: (हाँसो) (ताली) कमिकले महिनावारीप्रतिको संकोच हटाउने वातावरण बनाउन मद्धत गर्यो ।

source: Many of the volunteers took this prototype themselves to educate girls and take menstrual awareness workshops in five different states in India.
ne: कतिपय स्वयंसेवकहरुले यही नमूना लिएर युवतीहरुमा महिनावारीको सतर्कता जगाउने कार्यशाला संचालन गर्न भारतका विभिन्न ५ क्षेत्रहरुमा गए ।

source: And one of the volunteers took this prototype to educate young monks and took it to this monastery in Ladakh.
ne: यही नमूना किताब लिएर एकजना स्वयंसेवकले लद्दाखका युवा भिक्षुणीहरुलाई समेत महिनावारीको बारेमा जानकारी गराए ।

source: We made the final version of the book, called "Menstrupedia Comic" and launched in September last year.
ne: हामीले यो कमिकको पछिल्लो संस्करण - महिनावारीको कमिक नाममा गत वर्षको सेप्टेम्बरमा प्रकाशित गर्यौ ।

source: And so far, more than 4,000 girls have been educated by using the book in India and -- (Applause) Thank you.
ne: र अहिले सम्ममा भारतका ४००० भन्दा बढ़ी युवतीहरुले यो किताब पढिसकेका छन् । (ताली) धन्यवाद !

source: (Applause) And 10 different countries.
ne: ! (ताली) हामी स्थानीय संगठनहरुसंग मिलेर

source: We are constantly translating the book into different languages and collaborating with local organizations to make this book available in different countries.
ne: यो किताबलाई विभिन्न भाषामा अनुवाद गरेर अन्य १० देशमा उपलब्ध गराउदै छौ ।

source: 15 schools in different parts of India have made this book a part of their school curriculum to teach girls about menstruation.
ne: भारतका विभिन्न क्षेत्रका १५ स्कूलहरुले युवावर्गलाई महिनावारीबारे जानकारी दिने पाठ्यसामग्रीको रुपमा आफनो पाठ्यक्रममा समावेश गरेका छन् ।

source: (Applause) I am amazed to see how volunteers, individuals, parents, teachers, school principals, have come together and taken this menstrual awareness drive to their own communities, have made sure that the girls learn about periods at the right age and helped in breaking this taboo.
ne: (ताली) मलाई गर्वलाग्छ हाम्रो प्रयासप्रति जब देख्छु - विभिन्न स्वयंसेवकहरु, व्यक्तिहरु, अभिभावक, शिक्षक, प्रधानअध्यापकहरु सबै एकजुट भएर आफ्नो समुदायका युवतीहरुले सही उमेरमै महिनावारीको जानकारी प्राप्त गरुन् भन्दै यसप्रतिको संकोच हटाउन लागिपर्नुभएको देख्दा

source: I dream of a future where menstruation is not a curse, not a disease, but a welcoming change in a girl's life.
ne: एउटा यस्तो भविष्यको कल्पना गरौँ , जहाँ महिनावारी कुनै अभिशाप, कुनै रोग नभएर युवतीहरुको जीवनमा आउने एउटा सकारात्मक परिवर्तनको रुपमा स्वीकार गरिन्छ

source: And I would -- (Applause) And I would like to end this with a small request to all the parents here.
ne: (ताली) यहाँ आउनुभएका सबै अभिभावकहरुलाई सानो अनुरोध गर्दै, बिदा माग्न चाहन्छु

source: Dear parents, if you would be ashamed of periods, your daughters would be, too.
ne: प्रिय अभिभावकहरु ! रजश्वलाको बारेमा कुरा गर्न लाज मान्नुहुन्छ भने, तपाईका छोरीहरु पनि त्यसैको सिको गर्नेछन् ।

source: So please be period positive.
ne: त्यसैले, रजस्वला सकारात्मक बनिदिनुहोस्

source: Hello.
ne: नमस्कार !

source: This is my first trip, first time in life I'm outside of the walls of Gaza.
ne: ! यो मेरो पहिलो यात्रा हो, जीवनमा पहिलो पटक म गाजा क्षेत्र भन्दा बाहिर छु ।

source: I'm so happy to be here.
ne: यहाँ उभिन पाउँदा साह्रै खुशी छु ।

source: (Applause) My ambition always was to be a pilot, to fly a plane, to feel free to fly the sky, to touch the sky.
ne: (ताली) मेरो लक्ष्य पायलट हुने थियो, विमान उडाउने, स्वतन्त्रतापूर्वक आकाशमा उड्ने, आकाशलाई छुने,

source: But that didn't happen.
ne: तर त्यो पुरा भएन ।

source: Simply, I live in Gaza, there is no airport.
ne: किन कि, म गाजा क्षेत्रमा बस्छु, जहाँ एअरपोर्ट नै छैन ।

source: All borders are closed on every side.
ne: सबैतिरका बोर्डरहरु बन्द छन ।

source: We live in one of the biggest prisons in the world.
ne: हामी संसारकै ठुलो जेलमा बस्छौं ।

source: The only thing I can do is just to look up to the sky.
ne: म मात्र एउटा काम गर्न सक्छु, त्यो हो आकाशतिर फर्केर हेर्नु ।

source: On some days, we are lucky if we have electricity for four or five hours.
ne: कुनै दिन, ४/५ घण्टा बत्तीआयो भने, हामी आफूलाई भाग्यशाली सम्झिन्छौँ ।

source: When it's cold, we make a fire on the front or on the roof of our homes.
ne: चिसोबढेमा घर बाहिर वा छानामा आगो बाल्छौं

source: Sometimes we make food, too.
ne: कहिले काहीं, त्यहि आगोमा खान पकाउछौं ।

source: My job in Gaza is to arrange everything for journalists who come to my homeland to tell the stories about what's going on in Gaza.
ne: मेरो मातृभूमिमा आउने पत्रकारहरुलाई त्यहाँको घटनाको बास्तबिक स्थिति बुझ्न आवश्यक व्यवस्था मिलाउनु नै मेरो काम हो ।

source: Many mornings, I had to go to the border area to collect a journalist.
ne: धेरै बिहानिहरु, म पत्रकारहरु जम्मा गर्न बोर्डर छेउ पुग्छु ।

source: If anything should happen to the journalist, or if the journalist decides to cover a story the government doesn't want us to cover, bad things could happen.
ne: पत्रकारहरुमाथि केहि घटना घटे वा, पत्रकारहरुले प्रशारण गर्न चाहेको कुनै प्रसंग सरकारले जानकारी दिन नचाहेमा अप्ठ्यारो पर्न सक्छ ।

source: Navigating through my country helping journalists, filmmakers, news crews, is my working life.
ne: पत्रकारहरु, फिल्म निर्माता, समाचार संकलन सदस्यहरुलाइ देशको विभिन्न ठाउंहरु देखाउनु, मेरो पेशागत कार्य हो ।

source: I believe my success comes from building a relationship not only with journalists and the news crews, but also with the communities in the Gaza Strip.
ne: मलाई बिश्वास छ, पत्रकार र समाचार संकलन सदस्यहरु मात्रै नभएर, गाजा पट्टिका समूदायसंगको सम्बन्ध नै मेरो सफलताको कारण हो ।

source: These communities who don't want their stories to be told, I never looked to them as stories or numbers.
ne: आफ्नोबारेमा केहि भन्न नचाहने समूदायहरुलाइ म कुनै जबर्जस्ति गर्दिन ।

source: But like me, they are human beings.
ne: म जस्तै, उनीहरुपनि मानव हुन् ।

source: I have built up many relationships over 10 years.
ne: पछिल्लो १० बर्षमा मैंले धेरै सम्बन्धहरु विस्तार गरेकी छु ।

source: And guess what?
ne: त्यसैले,

source: This gives me the chance to get access to people, to stories that others can't.
ne: म ती मानिसहरुसम्म पुगेर जानकारी लिन सक्षम छु, जहाँ अरु पत्रकारहरु पुग्न सक्दैनन् ।

source: In some certain situations, I feel, as a woman, I have more power.
ne: कतिपय अवस्थामा, मलाई लाग्छ, महिला भएकोले म संग अझ बढी शक्ति छ ।

source: Many male journalists in my society, they want to cover a story about drug addiction in my country.
ne: मेरो समूदायका धेरै पुरुष पत्रकारहरु, लागु औषध लतबारे मुख्य समाचार बनाउन चाहन्छन् ।

source: That problem started when the Gaza tunnel was being built.
ne: गाजामा जब सुरुङ्ग बन्यो, यो समस्या पनि त्यहीं बाट सुरु भो ।

source: With the siege on Gaza, tunnels brought people all the basic needs like food, building material, other stuff we needed.
ne: गाजालाइ घेराबन्दी गरिएको समयमा दैनिक जीवनका प्रमुख साधनहरु जस्तै : खाद्यान्न, निर्माण रअरु आवश्यकताका सामाग्रीहरु यसै सुरुङ्गबाट लेराइन्थ्यो ।

source: But not anymore, because the Egyptian side flooded them up with water and they are not working anymore.
ne: अहिले इजिप्टतर्फको भाग बढीले बगाएकोले, यो सुरुङ्ग प्रयोगमा छैन ।

source: Drugs were being smuggled, and many young people got addicted, too.
ne: तर यहि सुरुङ्ग लागु औषध तस्करीको मार्ग बनेको छ र युवाहरु दुर्व्यसनमा फसेका छन् ।

source: In the tradition of the Palestinian society, it's forbidden for men to enter the household.
ne: प्यालिस्टेनी समूदायको चलनमा पुरुषहरुलाई अर्काको घरमा प्रवेश निषेध छ । त्यसैले पुरुष पत्रकारले,

source: So, no male journalists get the story.
ne: यो प्रसंग संकलन गर्न सकेनन् ।

source: But I did.
ne: तर मैंले सकेँ ।

source: I have a wonderful husband, a wonderful husband who supports me despite all the criticism he gets from the society.
ne: मैंले अशल श्रीमान पाएकी छु । समाजले गर्ने अनेक नकारात्मक टिकाटिप्पणीका बाबजुदपनि उहाँले मेरो काममा सहयोग गर्नुहुन्छ ।

source: He's at home now with my two kids, and I have another one that's growing in here.
ne: अहिले वहाँ २ बच्चाहरुसंग घरमा हुनुहुन्छ र तेस्रो मेरो पेटमा हुर्कैदै छ ।

source: (Applause) When I'm working, I call him every two hours, and he knows if he doesn't hear from me, he should call my contact, the one who gives me access to the story, which is the one who I trust.
ne: (ताली) काममा हुँदा, हरेक २ घन्टामा म श्रीमानलाई फोन गर्छु यदि मैंले फोन गरिन भने, मेरो श्रोत व्यक्तिसंग सम्पर्क गर्नुहुन्छ, जो मेरो विश्वासिलो छ र आवश्यक स्थानसम्म पुग्ने व्यवस्था मिलाईदिने गर्छ ।

source: One of the times in Gaza, during the kidnapping of the British journalist Alan Johnston, I was asked by an American magazine to set up a meeting with the kidnappers in Gaza, and I did.
ne: एक पटक गाजामा, ब्रिटिस पत्रकार एलन जोनस्टोनको अपहरण भएको ताका मलाई एउटा अमेरिकी पत्रिकाले गाजामा अपहरणकारीसंग भेट गराईदिन भन्यो, र मैंले त्यसको व्यवस्ता मिलाएँ ।

source: The journalist covering the story and I were asked to meet outside of his hotel.
ne: त्यो पत्रकार र मलाई, उनीहरु बसेको होटेलको बाहिर भेट्न बोलाए ।

source: They came, they picked us up in a black van with black windows, they were wearing masks on that day.
ne: उनीहरु आए र हामीलाई ऐना समेत कालो भएको कालो रंगको भ्यानमा लिएर गए, उनीहरुले अनुहारमा मास्क लगाएका थिए ।

source: And they drove us away, far away in the middle of a field.
ne: उनीहरुले हामीलाई टाढा लिएर गए, कुनै मध्ये क्षेत्रमा ।

source: They took our cell phones and we did the interview with the kidnapper outside in that field.
ne: हाम्रो फोन उनीहरुले लिए, हामीले ती अपहरणकारीसंग खुला मैदानमा अन्तर्वार्ता लियौं ।

source: I was so scared that day, a day I will never forget.
ne: त्यो दिन म साह्रै डराएको थिएँ , र त्यो दिन म कहिले बिर्सिन सक्दिन ।

source: So, why do I do what I do?
ne: म जे गरिरहेको छु, किन गर्दैछु ?

source: I do it because I believe if I didn't, a huge part of the story about Gaza will be missing.
ne: मलाई लाग्छ, यदि मैले यो काम गरिन भने, गाजा भित्रको अवस्था बारेमा संसार अनभिज्ञ हुन्छ ।

source: There are some more stories I could tell you about my country.
ne: म तपाईंलाइ मेरो देशको अरु धेरै प्रसंगहरु सुनाउन सक्छु ।

source: And not all of them are bad.
ne: ती सबै नराम्रा मात्रै पनि छैनन् ।

source: I love my country, despite the terrible situation we live in -- siege, poverty, unemployment -- but there is life.
ne: मलाई मेरो देशको माया लाग्छ । त्यहाँकोअवस्था बिकराल, घेराबन्दी, गरिबी, बेरोजगारीको डरलाग्दो अवस्थाबाट गुज्रीरहेको भएपनि त्यहाँ अझै जीवन छ ।

source: There are people who are dreamers and amazing people full of energy.
ne: त्यहाँपनि असाधारण सामर्थ्य र सपना भएका व्यक्तिहरु छन् ।

source: We have wonderful music, and a great music school.
ne: हामी संग राम्रो संगीत र बिशेष संगीत विद्यालय छ ।

source: We have parkour dancers who dance in the rubble of their homes.
ne: हामीसंग पार्कर डान्सर छन्, जो भत्केको घर भित्र पनि नाचको अभ्यास गर्दछन् ।

source: And Gaza is the only place in the Arab world where Muslims and Christians live in strong brotherhood.
ne: गाजा नै अरब देशहरु मध्येको एक मात्र देश हो, जहाँ मुस्लिम र क्रिस्चियन मिलेर बसेका छन् ।

source: (Applause) During the time of war, the hardest part for me is leaving the house early in the morning, leaving my children.
ne: (ताली) युद्धको समयमा, बच्चाहरुलाई छोडेर बिहानै घरबाट निस्कनु सबै भन्दा कठिन कार्य हो ।

source: I take a picture of them everyday because I never know if I will make it back to them.
ne: म हरेक दिन उनीहरुको फोटो खिच्ने गर्छु, किनकि, मलाई थाहा छैन, फर्केर आइपुग्छु कि पुग्दीन ।

source: Being a fixer and a journalist is difficult and dangerous in Gaza.
ne: गाजामा समन्वयकर्ता र पत्रकार बन्नु खतरापूर्ण कार्य हो ।

source: But when I hear the sound of the shelling or the sound of the bombing, I just head straight toward it, because I want to be there first, because these stories should be told.
ne: जब म गोलि चलेको वा बम पढ़केको आवाज सुन्छु, म त्यतै दौडीहाल्छु, किनकि म घटनाको बारेमा जानकारीदिने पहिलो व्यक्ति बन्न चाहन्छु ।

source: When my children were small and we heard the sound of the war, I used to tell them that they were fireworks.
ne: केटाकेटीहरु सानो हुँदा, जब हामी युद्धको आवाज सुन्थ्यौं, हामी उनीहरुलाई यो पटाकाको आवाज हो भनेर सम्झाउथ्यौं ।

source: Now they are older, they understand.
ne: अब उनीहरु हुर्की सके, आफै बुझ्ने भइसके ।

source: I do have terrible nightmares because of all that I witnessed during war times, especially these lifeless bodies of young children.
ne: म डरलाग्दा सपनाहरु देख्ने गर्छु, किनकि युद्धको समयमा मैंले धेरै युवाहरुको धेरै लाश देखेकोछु ।

source: I still remember a little girl, her name is Hala.
ne: हाला नाम गरेकी सानी केटीलाई अझै सम्झिन्छु,

source: She's the only survivor from her family.
ne: उसको परिवारमा जीवित रहने उ एउटी मात्रै थिई

source: Her picture will be with me forever.
ne: उसको तस्वीर म संग सधैं रहीरहने छ ।

source: I will never forget her.
ne: म उसलाई कहिले बिर्सिन सक्दिन ।

source: I'm proud that I can stand here and be here today with you.
ne: यहाँ, तपाईंहरुको सामुन्ने उभिएर बोल्दा, म गौरवान्नित छु ।

source: I'm proud that I can tell you stories, sad and happy, stories about my small corner of the world, Gaza.
ne: संसारको एउटा सानो कुना गाजाको राम्रा नराम्रा कथाहरु सुनाउन पाउँदा, मलाई गर्व लाग्दछ ।

source: I'm proud that I am the first female fixer working in Gaza.
ne: यस क्षेत्रमा काम गर्ने गाजाको पहिलो महिला हो म ।

source: And the funny thing is they call me Mr. Rambo in Gaza.
ne: रमाइलो कुरा, मलाई "गाजाको राम्बो" भन्छन् ।

source: (Laughter) I hope one day, I will get the chance to tell the stories of all other women, all other amazing women I know in my country.
ne: (हाँसो) मलाई आशा छ, कुनै दिन, म मेरो देशका अरुपनि महिलाहरुको प्रसंग सुनाउने अवसर पाउने छु ।

source: I hope that one day I can help other women in my country to be fixers like me.
ne: म आशा गर्दछु, कुनै दिन, यहि क्षेत्रमा आउन चाहने महिलाहरुलाई मद्धत गर्न सक्नेछु ।

source: And of course sometimes, I feel I can't do this work anymore, it's just too much for me.
ne: कहिले कहीं यस्तो पनि लाग्छ, अब म यो काम गर्न सक्दिन, यहाँ भन्दा अगाडी जान सक्दिन ।

source: But I remember these words: "Don't limit your challenge, but challenge your limit.
ne: तर फेरी यी शब्दहरु सम्झिन्छु : - "आफ्नो चुनौतीलाइ सिमित नगर, बरु सिमिततालाइ चुनौती गर ।

source: Don't allow others to stand in front of your dreams."
ne: तिम्रो पाइला रोक्ने अधिकार कसैलाई नदेउ ।"

source: I was three months pregnant with twins when my husband Ross and I went to my second sonogram.
ne: मेरो गर्भमा ३ महिने जुम्ल्याहा बच्चाहरु थिए, जतिखेर म र मेरो श्रीमान रस दोश्रो सोनोग्राम गर्न गएका थियौं ।

source: I was 35 years old at the time, and I knew that that meant we had a higher risk of having a child with a birth defect.
ne: तेतिखेर म ३५ बर्षकी थिएँ , यसको अर्थ हामीलाई थाहा थियो - जन्म दोष भएको बच्चा जन्मिने खतरा छ ।

source: So, Ross and I researched the standard birth defects, and we felt reasonably prepared.
ne: रोस र मैलें, सम्भावित जन्म दोषहरुको बारेमा अध्ययन गरेर एक किसिमको तयारी अवस्थामा बस्यौं ।

source: Well, nothing would have prepared us for the bizarre diagnosis that we were about to face.
ne: तर हामीले भोग्न गइरहेको बिकराल समस्याको, कसैसंग केहि तयारी थिएन ।

source: The doctor explained that one of our twins, Thomas, had a fatal birth defect called anencephaly.
ne: डाक्टरले भने - जुम्ल्याहा मध्ये थमसमा Anencephaly भन्ने जन्म दोष छ ।

source: This means that his brain was not formed correctly because part of his skull was missing.
ne: भन्नाले, उसको मस्तिस्क बिकशित थिएन कारण-उसको खप्परको एक टुक्रा बनेकै थिएन ।

source: Babies with this diagnosis typically die in utero or within a few minutes, hours or days of being born.
ne: यस्ता बच्चाहरुको गर्भमै वा, जन्मेको केहि मिनेट, घण्टा वा केहि दिनमा मृत्यु हुन्छ ।

source: But the other twin, Callum, appeared to be healthy, as far as the doctor could tell, and these twins were identical, genetically identical.
ne: जुम्ल्याहामध्ये अर्को क्यालम भने डाक्टरले देखेसम्म स्वस्थ नै थियो, यी जुम्ल्याहरु उस्तै थिए, आनुवंसिकरुपमा समान थिए ।

source: So after a lot of questions about how this could have possibly happened, a selective reduction was mentioned, and while this procedure was not impossible, it posed some unique risks for the healthy twin and for me, so we decided to carry the pregnancy to term.
ne: अब अगाडी के गर्ने भन्ने बिषयमा लामो छलफल पछि, यौटा उपाय निक्सियो यो उपाय असंभव पनि थिएन, तर यसले स्वस्थ बच्चा र मेरो स्वास्थमा खतरा हुन सक्थ्यो तेसैले हामीले गर्भलाइ पूर्णता दिने निर्णय गर्यौं

source: So there I was, three months pregnant, with two trimesters ahead of me, and I had to find a way to manage my blood pressure and my stress.
ne: तिन महिने गर्भवती, ६ महिना गर्भ अवधि बाकि, तनाब र ब्लड प्रेसर कसरी नियन्त्रण गर्ने, गाह्रो थियो ।

source: And it felt like having a roommate point a loaded gun at you for six months.
ne: अबको ६ महिना मेरो जीवन कन्चटमा बन्दुक तेर्स्याए जस्तै हुन गैरहेको थियो ।

source: But I stared down the barrel of that gun for so long that I saw a light at the end of the tunnel.
ne: मैंले त्यो बन्दुकको नालीलाई लामो समयसम्म घुरेर हेरीरहंदा, अर्को भागमा आशाको किरण देखेजस्तो लाग्यो

source: While there was nothing we could do to prevent the tragedy, I wanted to find a way for Thomas's brief life to have some kind of positive impact.
ne: सम्भावित दुर्घटना रोक्न सक्ने हाम्रो सामर्थ्य त थिएन, तैपनि थमसको छोटो जिन्दगीको कसरी सकारात्मक प्रभाब बनाउन सकिएला, म सोच्न थालें ।

source: So I asked my nurse about organ, eye and tissue donation.
ne: मैले नर्सलाइ आँखा, टिस्यु तथा अन्य अंगदानको बारेमा सोधें

source: She connected with our local organ-procurement organization, the Washington Regional Transplant Community.
ne: उनले नजिकको - वाशिंगटन क्षेत्रीय अंग प्रत्यारोपण समूह (WRTC) संग सम्पर्क गराईदिइन l

source: WRTC explained to me that Thomas would probably be too small at birth to donate for transplant, and I was shocked: I didn't even know you could be rejected for that.
ne: WRTC ले मलाई भन्यो - नवजात शिशुको अंग सानो हुने हुँदा प्रत्यारोपण गर्न मिल्दैन । म चकित परें । अङ्गदानपनि अस्वीकृत हुनसक्छ भन्ने मलाई थाहा थिएन

source: But they said that he would be a good candidate to donate for research.
ne: उनीहरुले एउटा उपाय सुझाए - रिसर्चकोलागि पनिअंगदान गर्न सकिन्छ ।

source: This helped me see Thomas in a new light.
ne: यो उपायले थमसलाइ नया प्रकाश दियो ।

source: As opposed to just a victim of a disease, I started to see him as a possible key to unlock a medical mystery.
ne: केवल रोगको सिकार बन्नुको सट्टा, चिकित्सा रहस्य पत्तालगाउन सक्ने एउटा अवसर मैंले देखें ।

source: On March 23, 2010, the twins were born, and they were both born alive.
ne: मार्च २३, २०१० मा दुवै जुल्याहाहरु जीबितै जन्मे ।

source: And just like the doctor said, Thomas was missing the top part of his skull, but he could nurse, drink from a bottle, cuddle and grab our fingers like a normal baby, and he slept in our arms.
ne: डाक्टरले भनेजस्तै थमसको खप्परको माथिल्लो भाग थिएन , तैपनि उ अरु साधारण बच्चा जस्तै, आमाको, सिसिको दुध चुस्न, चल्न, हाम्रो औंला समाउन तथा हाम्रो अंगालोमा निधाउन सक्थ्यो ।

source: After six days, Thomas died in Ross's arms surrounded by our family.
ne: ६ दिन पछि, हाम्रै माझमा, रोसको अंगालोमा थमसले अन्तिम स्वास लियो ।

source: We called WRTC, who sent a van to our home and brought him to Children's National Medical Center.
ne: हामीले WRTC लाइ फोन गर्यौं, उनीहरुले हाम्रो घरमा गाडी पठाए उसलाई रास्ट्रिय बाल उपचार केन्द्रमा लगियो

source: A few hours later, we got a call to say that the recovery was a success, and Thomas's donations would be going to four different places.
ne: केहि घण्टापछि, अंग निकाल्न सफलता मिलेको खबर आयो थमसको अंग बिभिन्न ४ ठाउंमा पठाइने भयो ।

source: His cord blood would go to Duke University.
ne: कर्ड ब्लड - डियुक यूनिवर्सिटी,

source: His liver would go to a cell-therapy company called Cytonet in Durham.
ne: कलेजो - सेल थेरापी कम्पनि (Cytonet in Durham),

source: His corneas would go to Schepens Eye Research Institute, which is part of Harvard Medical School, and his retinas would go to the University of Pennsylvania.
ne: उसको कर्निया - Schepens Eye Research Institute (हार्वर्ड मेडिकल यूनिवर्सिटीको भाग) र रेटिना - यूनिवर्सिटी अफ पेन्सेलभेनिया पठाइयो ।

source: A few days later, we had a funeral with our immediate family, including baby Callum, and we basically closed this chapter in our lives.
ne: केहि दिन पछि, हामीले क्यालमसमेत भएर थमसको मृत्यु संस्कार गर्यौं, र बिस्तारै यो घटना बिर्सिदै गयौं ।

source: But I did find myself wondering, what's happening now?
ne: मेरो मनमा बारम्बार प्रश्न उठी रह्यो, अहिले के भैरहेको होला ?

source: What are the researchers learning?
ne: रिसर्चबाट के थाहा भयो होला ?

source: And was it even worthwhile to donate?
ne: अंगदान गर्नुको कुनै अर्थ रह्यो कि रहेन होला ?

source: WRTC invited Ross and I to a grief retreat, and we met about 15 other grieving families who had donated their loved one's organs for transplant.
ne: WRTC ले रोस र मलाई एउटा शोक सभामा बोलायो, जहाँ, हामी जस्तै अन्य १५ दुखि परिवार थिए, जसले आफ्नो प्रिय मान्छेको अंगदान गरेका थिए ।

source: Some of them had even received letters from the people who received their loved one's organs, saying thank you.
ne: ती मध्ये कतिले अंगदान प्राप्त गर्ने परिवारले पठाएका धन्यबाद पत्र समेत प्राप्त गरेका रहेछन ।

source: I learned that they could even meet each other if they'd both sign a waiver, almost like an open adoption.
ne: मैंले के पनि थाहा पाएँ भने, अंग लिने दिनेको परिवारले आपसी समझदारीमा भेटघाट समेत गर्दा रहेछन ।

source: And I was so excited, I thought maybe I could write a letter or I could get a letter and learn about what happened.
ne: मलाई पनि, कसैलाई धन्यवाद पत्र लेखौं कि, वा रिसर्चमा के भैरहेछ भन्ने पत्र प्राप्त होला कि, खुल्दुली लाग्यो

source: But I was disappointed to learn that this process only exists for people who donate for transplant.
ne: तर यो सुनेर दुख लाग्यो, यस्तो भेटघाट अंग प्रत्यारोपण गर्नेको बिचमा मात्रै हुन्छ

source: So I was jealous. I had transplant envy, I guess.
ne: मलाई प्रत्यारोपण पद्धतिकै डाहा लाग्यो ।

source: (Laughter) But over the years that followed, I learned a lot more about donation, and I even got a job in the field.
ne: (हाँसो) तेस्को केहि बर्ष पछि मैंले अंगदानको बिषयमा धेरै कुरा जानें र यसै क्षेत्रमा काम गरेँ ।

source: And I came up with an idea.
ne: एकदिन मनमा एउटा विचार आयो
